elot-defs.org
* Helper functions for ELOT
** elisp functions
:PROPERTIES:
:header-args: :tangle ./elot-package/elot.el :comments link
:END:
*** Header for the elisp file
#+begin_src emacs-lisp :comments nil
  ;;; elot.el --- Emacs Literate Ontology Tool (ELOT)   -*- lexical-binding: t; -*-

  ;; Copyright (C) 2024 Johan W. Klüwer

  ;; Author: Johan W. Klüwer <johan.w.kluwer@gmail.com>
  ;; URL: https://github.com/johanwk/elot
  ;; Version: 0.1-pre
  ;; Package-Requires: ((emacs "29.2") ... and several more ...)
  ;; Keywords: org, ontology

  ;; This file is not part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; This package is for authoring OWL ontologies using org-mode.

  ;;;; Installation

  ;; Install the packages ... .  Then put this file in your `load-path', and put this in
  ;; your init file:

  (require 'ob-lob) ; Library of Babel
  (require 'ox) ; export functions
  (require 'ol) ; link functions
  (require 'org-tempo) ; link functions
  (require 'htmlize) ; fontify blocks
  (require 'omn-mode) ; OMN support

  ;;;; Usage

  ;; ... create a new file, use <template inserting function> to insert a template ontology ...

#+end_src
*** OMN keywords
In omn-mode, there's variables for entity and property
keywords. However, there the keyword "Import" is placed in the
"entity" list, while we need this for ontology declaration in a
"property" list. It also includes "DisjointUnion", which doesn't apply
in ELOT, since not dependent on any particular resource.

ELOT isn't set up (2024-03-24) for declaring individuals, but this
will change, so the appropriate keywords are included.
#+begin_src emacs-lisp
  (defvar elot-omn-property-keywords
  '(
      "EquivalentTo"
      "SubClassOf"
      "Characteristics"
      "DisjointWith"
      "Domain"
      "Range"
      "InverseOf"
      "SubPropertyOf"
      "SubPropertyChain"
      "SameAs"
      "DifferentFrom"
      "Types"
      "Facts"
      "HasKey"
      "Import"
      ))
#+end_src

We add a filter to make OMN in description lists =\ttfamily=. See [[https://orgmode.org/manual/Advanced-Export-Configuration.html][manual]].
#+begin_src emacs-lisp
  (defun elot-latex-filter-omn-list (text backend info)
    "Format OMN content in description lists"
    (when (org-export-derived-backend-p backend 'latex)
      (when (seq-some (lambda (x) (string-match x text))
             elot-omn-property-keywords)
        (replace-regexp-in-string "\\\\item.{\\([a-zA-Z]+\\)}. \\(.*\\)" "\\\\item[\\\\normalfont\\\\ttfamily\\\\small \\1] \\\\lstinline[language=omn]{\\2}" text))))
  (add-to-list 'org-export-filter-plain-list-functions
             'elot-latex-filter-omn-list)
#+end_src
*** Looking at
Introduced because ontology-defining headings don't have
subsections. Revisit to cover other kinds of headings, and probably a
better way to identify than matching with ID string.
#+begin_src emacs-lisp
  (defun at-ontology-heading ()
    (let ((id (or (org-entry-get (point) "ID") "")))
     (string-match "ontology-declaration" id)))
#+end_src
*** Get description lists into lisp lists
#+name: defun-desc-lists
#+BEGIN_SRC emacs-lisp :results silent
  (defun org-elt-exists (x elt)
    (org-element-map x elt #'identity))
  (defun org-elt-item-tag-str (x)
    "for an item in an org-element-map, return the item tag"
    (if (org-element-property :tag x)
        (substring-no-properties (org-element-interpret-data (org-element-property :tag x)))))
  (defun org-elt-item-pars-str (x)
    "for an item in an org-element map, return the paragraphs as one string"
    (replace-regexp-in-string "\\([^
  ]\\)\n[ \t]*" "\\1 "
   (string-trim (apply 'concat
                       (org-element-map x '(paragraph plain-list)
                         (lambda (y) (substring-no-properties 
                                      (org-element-interpret-data y)))
                         nil nil 'plain-list)))))
  (defun org-elt-item-str (x)
    (list (org-elt-item-tag-str x) (org-elt-item-pars-str x)))
  (defun org-descriptions-in-section-helper ()
    (org-element-map (org-element-parse-buffer) 'item
      (lambda (y) (if (org-element-property :tag y)
                      (append (org-elt-item-str y)
                              (if (org-elt-exists (cdr y) 'item)
                                  (org-element-map (cdr y) 'item
                                    (lambda (z) (if (org-element-property :tag z)
                                                    (org-elt-item-str z))) nil nil 'item))
                              ))) nil nil 'item))

  (defun org-descriptions-in-section ()
    "return any description list items in current section as a list of strings"
    (interactive)
                                          ; narrow our area of interest to the current section, before any subsection
    (let ((section-begin) (section-end))
      (save-restriction 
        (save-excursion
          (unless (org-at-heading-p) (org-previous-visible-heading 1))
          (setq section-begin (org-element-property :contents-begin (org-element-at-point)))
          (outline-next-heading)
          (setq section-end (point))
          (if (or (null section-begin) (<= section-end section-begin))
              nil ; maybe this outline section is empty
            (progn
              (narrow-to-region section-begin section-end)
                                          ; return all paragraphs--description items as pairs in a list
              (org-descriptions-in-section-helper)))))))

  (defun org-subsection-descriptions ()
    "return a plist for the outline at point, of headlines paired with plists of description-list items and values."
    (save-restriction
      (save-excursion
        (unless (org-at-heading-p) (org-previous-visible-heading 1)) ; ensure we are at a heading
        (org-narrow-to-subtree)
        (if ;; don't include the section that has the target property id itself, except if ontology section
            (or (outline-next-heading)
              (at-ontology-heading))
            (let (ret)
              (while (let ((heading (substring-no-properties (org-get-heading nil t)))
                           (descriptions (org-descriptions-in-section)))
                       (unless (or (string-match-p "COMMENT" heading)
                                   (member "nodeclare" (org-get-tags (point) t)))
                         (setq ret
                               (cons
                                (if descriptions
                                    (list heading descriptions)
                                  (list heading))
                                ret)))
                       (outline-next-heading)))
              (nreverse ret))))))
#+END_SRC

