elot-defs.org
*** Write entity declarations
#+name: defun-resource-declaration
#+BEGIN_SRC emacs-lisp :results silent
  (defun omn-declare (str owl-type)
    "Given a string STR and an OWL type owl-type, write a Manchester Syntax entity declaration. Add rdfs:label annotation. If a parenthesis is given, use that as resource id."
    ;; check whether we have a label and a resource in parentheses
    (let* ((suri (entity-from-header str)))
      (concat owl-type ": " suri)))

  (defun annotation-entries (l &optional sep)
    "l is a list of puri--string pairs, each perhaps with a trailing list of similar, meta-annotation pairs. sep is 2 x indent blanks"
    (let ((indent (make-string (if sep (* 2 sep) 6) ?\ ))
          ;; l-uri-entries is the description list after purging any
          ;; items that have a prefix that isn't included as a LINK
          ;; entry, which goes into org-link-abbrev-alist-local. Note
          ;; that expanded URIs in brackets <...> are let through.
          (l-uri-entries
           (cl-remove-if (lambda (x) (string-equal (car x)
                                                   (unprefix-uri (car x) org-link-abbrev-alist-local)))
                         l)))
      (if (atom l) "\n"
        (concat "\n" indent "Annotations: " 
                (mapconcat (lambda (y)
                             (concat
                              (if (consp (caddr y)) ; we have meta-annotations
                                  (concat (annotation-entries (cddr y) 4) "\n " indent))
                              (car y)
                              (annotation-string-or-uri (cadr y))))
                           l-uri-entries
                           (concat ",\n " indent))))))

  (defun restriction-entries (l)
    "l is a list of puri--string pairs, except we'll pick up Manchester Syntax vocabulary and use as such"
    (let ((indent (make-string 2 ?\ ))
          (l-omn-entries
           (cl-remove-if-not (lambda (x) (member (car x)
                                                 elot-omn-property-keywords))
                             l)))
      (if (atom l) "\n"
        (concat "\n" indent
                (mapconcat (lambda (y)
                             (concat
                              (car y) ": "
                              (if (consp (caddr y)) ; we have meta-annotations
                                  (concat (annotation-entries (cddr y) 4) "\n " indent))
                              (if (string-equal (car y) "Import") ; ontology import special case
                                  (annotation-string-or-uri (cadr y))
                                (omn-restriction-string (cadr y)))
                              ))
                           l-omn-entries
                           (concat "\n" indent))))))

  (defun omn-annotate (l)
    (let* ((str (car l))
           (suri (entity-from-header str))
           (prefix (if (string-match "\\(.*\\):\\(.*\\)" suri)
                       (match-string 1 suri) ""))
           (localname (if (string= prefix "") suri (match-string 2 suri)))
           (label (if (string-match "\\(.+\\) (.*)" str)
                      (match-string 1 str) localname))
           (resource-annotations
            (cons (list "rdfs:label" label) (cadr l))))
      (annotation-entries resource-annotations)))

  (defun omn-restrict (l)
    (restriction-entries (cadr l)))

  (defun resource-declarations (l owl-type)
    "Take a possibly list of identifiers with annotations, declare to be of owl-type."
    (mapconcat
     (lambda (x) 
       (concat
        (omn-declare (car x) owl-type)
        ;; if annotations, add to the annotation block that has been started with rdfs:label
        (omn-annotate x)
        (omn-restrict x)
        ))
     l "\n"))

  (defun resource-declarations-from-header (header-id owl-type)
    "HEADER-ID is an org location id, OWL-TYPE is Class, etc."
    (save-excursion
      (org-id-goto header-id)
      (let ((entity-l (org-subsection-descriptions)))
        (if (or entity-l (string= owl-type "Ontology"))
            (resource-declarations entity-l owl-type)
          "## (none)"))))
  ;;(cdr (org-subsection-descriptions))))
#+END_SRC
*** Update link alist from table
*** Default settings
#+begin_src emacs-lisp :tangle ./elot-package/elot-defaults.el
  ;; default settings, replaces Local Variables block
  (setq-local
   org-confirm-babel-evaluate nil
   org-export-allow-bind-keywords t
   org-babel-default-inline-header-args '((:exports . "code"))
   org-latex-src-block-backend 'listings
   org-latex-prefer-user-labels t
   org-latex-image-default-scale .8
   time-stamp-line-limit 100
   time-stamp-format "%Y-%m-%d %H:%M"
   time-stamp-active t
   time-stamp-start "(version of "
   time-stamp-end ")"
   org-startup-folded 'show2levels
   org-export-with-sub-superscripts nil  ; preserve "_"
   org-export-headline-levels 8  ; deep numbering
   org-export-with-section-numbers 8  ; deep numbering
   org-latex-default-class "elot-scrreprt"
   org-latex-packages-alist
   (append org-latex-packages-alist 
           '(("" "svg" t)
             ("" "enumitem" t)
             "\\setlist[description]{font=\\normalfont\\itshape\\space}"
             "\\sloppy"
             ;; subsubsubsection, see https://tex.stackexchange.com/questions/356567/subsubsubsection-for-scrbook
             "\\DeclareNewSectionCommand[style=section,counterwithin=subsubsection,afterskip=1.5ex plus .2ex,"
             "  beforeskip=3.25ex plus 1ex minus .2ex,afterindent=false,level=\\paragraphnumdepth,tocindent=10em,"
             "  tocnumwidth=5em]{subsubsubsection}"
             "\\RedeclareSectionCommand[level=\\numexpr\\subsubsubsectionnumdepth+1\\relax,toclevel=\\numexpr\\subsubsubsectiontocdepth+1\\relax,]{paragraph}"
             "\\RedeclareSectionCommand[level=\\numexpr\\subsubsubsectionnumdepth+2\\relax,toclevel=\\numexpr\\subsubsubsectiontocdepth+2\\relax,]{subparagraph}"
             "\\RedeclareSectionCommand[counterwithin=subsubsubsection,tocnumwidth=6em]{paragraph}"
             "\\RedeclareSectionCommand[tocnumwidth=7em]{subparagraph}"
             ;; section numbers in margin
             "\\RedeclareSectionCommands[runin=false,afterskip=1.5ex plus .2ex,afterindent=false,indent=0pt]{paragraph,subparagraph}"
             "\\renewcommand\\othersectionlevelsformat[3]{\\makebox[0pt][r]{#3\\autodot\\enskip}}"
             "\\renewcommand\\sectionformat{\\makebox[0pt][r]{\\thesection\\autodot\\enskip}}"
             "\\renewcommand\\subsectionformat{\\makebox[0pt][r]{\\thesubsection\\autodot\\enskip}}"
             "\\renewcommand\\subsubsectionformat{\\makebox[0pt][r]{\\thesubsubsection\\autodot\\enskip}}"
             "\\renewcommand\\subsubsubsectionformat{\\makebox[0pt][r]{\\thesubsubsubsection\\autodot\\enskip}}"
             "\\renewcommand\\paragraphformat{\\makebox[0pt][r]{\\theparagraph\\autodot\\enskip}}"
             "\\renewcommand\\subparagraphformat{\\makebox[0pt][r]{\\thesubparagraph\\autodot\\enskip}}"
             "\\hypersetup{pdfborder=0 0 0}"
             "\\lstdefinelanguage{omn}{basicstyle=\\small\\ttfamily,commentstyle=\\color{gray},frame=single,breaklines=true,breakatwhitespace=true,postbreak=\\mbox{{\\color{gray}\\tiny$\\rightarrow$}},tabsize=2,comment=[l]{\\#},columns=fullflexible,}"
             "\\lstdefinelanguage{ttl}{basicstyle=\\footnotesize\\ttfamily,commentstyle=\\color{gray},frame=single,breaklines=true,breakatwhitespace=true,postbreak=\\mbox{{\\color{gray}\\tiny$\\rightarrow$}},tabsize=2,comment=[l]{\\#},columns=fullflexible,}"
             "\\lstdefinelanguage{sparql}{basicstyle=\\footnotesize\\ttfamily,commentstyle=\\color{gray},frame=single,breaklines=true,breakatwhitespace=true,postbreak=\\mbox{{\\color{gray}\\tiny$\\rightarrow$}},tabsize=2,comment=[l]{\\#},columns=fullflexible,}"
             ))
   )
  (progn
    (load-library "elot")
    (update-link-abbrev)
    (org-babel-lob-ingest (replace-regexp-in-string "/[^/]+$" "/elot-lob.org" (locate-library "elot")))
    (org-cycle-set-startup-visibility)
    (add-to-list 'org-latex-classes
                 '("elot-scrreprt"
                   "\\documentclass[11pt,a4paper,numbers=noenddot,twoside=false]{scrreprt}
  [DEFAULT-PACKAGES]
  [PACKAGES]
  [EXTRA]"
                   ontology-resource-section
                   ))
    )
#+end_src
#+begin_src emacs-lisp
  (defun update-link-abbrev ()
    (if (save-excursion (goto-char (point-min))
                        (re-search-forward "^#[+]name: prefix-table$" nil t))
        (setq-local org-link-abbrev-alist-local
                    (mapcar (lambda (x) 
                              (cons (replace-regexp-in-string ":" "" (car x)) (cadr x)))
            (cl-remove 'hline (org-babel-ref-resolve "prefix-table")))
                    )))
#+end_src
*** Write typical class patterns
**** one-of
It's common to say a class is a subclass of the union of immediate
subclasses. The function =class-oneof-from-header= is intended to be
used in =resource-taxonomy-from-l=. 

It's common to say a set of immediate subclasses are disjoint. The
function =class-disjoint-from-header= is intended to be used in
=resource-taxonomy-from-l=.
#+name: defun-class-patterns
#+BEGIN_SRC emacs-lisp
  (defun class-oneof-from-header (l)
    "L a list of class resources like ((super (((sub) (sub) ... (sub)))))."
    (let ((owl-type "Class") (owl-subclause "SubClassOf"))
      (concat "\n" owl-type ": " (entity-from-header (car l))
              "\n    " owl-subclause ": "
              (mapconcat (lambda (x)
                           (entity-from-header (car x)))
                         (cdr l) " or "))))

  (defun class-disjoint-from-header (l)
    "L a list of class resources like ((super (((sub) (sub) ... (sub)))))."
      (concat "\nDisjointClasses: "
              "\n    "
              (mapconcat (lambda (x)
                           (entity-from-header (car x)))
                         (cdr l) ", ")))
#+END_SRC
