elot-package/elot.el

;; [[file:../elot-defs.org::defun-resource-declaration][defun-resource-declaration]]
(defun omn-declare (str owl-type)
  "Given a string STR and an OWL type owl-type, write a Manchester Syntax entity declaration. Add rdfs:label annotation. If a parenthesis is given, use that as resource id."
  ;; check whether we have a label and a resource in parentheses
  (let* ((suri (entity-from-header str)))
    (concat owl-type ": " suri)))

(defun annotation-entries (l &optional sep)
  "l is a list of puri--string pairs, each perhaps with a trailing list of similar, meta-annotation pairs. sep is 2 x indent blanks"
  (let ((indent (make-string (if sep (* 2 sep) 6) ?\ ))
        ;; l-uri-entries is the description list after purging any
        ;; items that have a prefix that isn't included as a LINK
        ;; entry, which goes into org-link-abbrev-alist-local. Note
        ;; that expanded URIs in brackets <...> are let through.
        (l-uri-entries
         (cl-remove-if (lambda (x) (string-equal (car x)
                                                 (unprefix-uri (car x) org-link-abbrev-alist-local)))
                       l)))
    (if (atom l) "\n"
      (concat "\n" indent "Annotations: " 
              (mapconcat (lambda (y)
                           (concat
                            (if (consp (caddr y)) ; we have meta-annotations
                                (concat (annotation-entries (cddr y) 4) "\n " indent))
                            (car y)
                            (annotation-string-or-uri (cadr y))))
                         l-uri-entries
                         (concat ",\n " indent))))))

(defun restriction-entries (l)
  "l is a list of puri--string pairs, except we'll pick up Manchester Syntax vocabulary and use as such"
  (let ((indent (make-string 2 ?\ ))
        (l-omn-entries
         (cl-remove-if-not (lambda (x) (member (car x)
                                               elot-omn-property-keywords))
                           l)))
    (if (atom l) "\n"
      (concat "\n" indent
              (mapconcat (lambda (y)
                           (concat
                            (car y) ": "
                            (if (consp (caddr y)) ; we have meta-annotations
                                (concat (annotation-entries (cddr y) 4) "\n " indent))
                            (if (string-equal (car y) "Import") ; ontology import special case
                                (annotation-string-or-uri (cadr y))
                              (omn-restriction-string (cadr y)))
                            ))
                         l-omn-entries
                         (concat "\n" indent))))))

(defun omn-annotate (l)
  (let* ((str (car l))
         (suri (entity-from-header str))
         (prefix (if (string-match "\\(.*\\):\\(.*\\)" suri)
                     (match-string 1 suri) ""))
         (localname (if (string= prefix "") suri (match-string 2 suri)))
         (label (if (string-match "\\(.+\\) (.*)" str)
                    (match-string 1 str) localname))
         (resource-annotations
          (cons (list "rdfs:label" label) (cadr l))))
    (annotation-entries resource-annotations)))

(defun omn-restrict (l)
  (restriction-entries (cadr l)))

(defun resource-declarations (l owl-type)
  "Take a possibly list of identifiers with annotations, declare to be of owl-type."
  (mapconcat
   (lambda (x) 
     (concat
      (omn-declare (car x) owl-type)
      ;; if annotations, add to the annotation block that has been started with rdfs:label
      (omn-annotate x)
      (omn-restrict x)
      ))
   l "\n"))

(defun resource-declarations-from-header (header-id owl-type)
  "HEADER-ID is an org location id, OWL-TYPE is Class, etc."
  (save-excursion
    (org-id-goto header-id)
    (let ((entity-l (org-subsection-descriptions)))
      (if (or entity-l (string= owl-type "Ontology"))
          (resource-declarations entity-l owl-type)
        "## (none)"))))
;;(cdr (org-subsection-descriptions))))
;; defun-resource-declaration ends here

;; [[file:../elot-defs.org::*Default settings][Default settings:2]]
(defun update-link-abbrev ()
  (if (save-excursion (goto-char (point-min))
                      (re-search-forward "^#[+]name: prefix-table$" nil t))
      (setq-local org-link-abbrev-alist-local
                  (mapcar (lambda (x) 
                            (cons (replace-regexp-in-string ":" "" (car x)) (cadr x)))
          (cl-remove 'hline (org-babel-ref-resolve "prefix-table")))
                  )))
;; Default settings:2 ends here

;; [[file:../elot-defs.org::defun-class-patterns][defun-class-patterns]]
(defun class-oneof-from-header (l)
  "L a list of class resources like ((super (((sub) (sub) ... (sub)))))."
  (let ((owl-type "Class") (owl-subclause "SubClassOf"))
    (concat "\n" owl-type ": " (entity-from-header (car l))
            "\n    " owl-subclause ": "
            (mapconcat (lambda (x)
                         (entity-from-header (car x)))
                       (cdr l) " or "))))

(defun class-disjoint-from-header (l)
  "L a list of class resources like ((super (((sub) (sub) ... (sub)))))."
    (concat "\nDisjointClasses: "
            "\n    "
            (mapconcat (lambda (x)
                         (entity-from-header (car x)))
                       (cdr l) ", ")))
;; defun-class-patterns ends here
