elot-package/elot.el

;; [[file:../elot-defs.org::defun-resource-taxonomy][defun-resource-taxonomy]]
(defun org-tags-in-string (str)
  "Return list of any tags in org-mode :asdf:lksjdf: from STR"
  (if (string-match ".*\\W+:\\(.*\\):" str)
      (split-string (match-string 1 str) ":")))

(defun resource-taxonomy-from-l (l owl-type owl-subclause)
  (if (listp (car l))
      (mapconcat (lambda (x) (resource-taxonomy-from-l x owl-type owl-subclause)) l "")
    (if (and (stringp (car l)) (stringp (caadr l)))
        (concat 
          ;simple subclass clauses
          (mapconcat (lambda (x)
                      (concat "\n" owl-type ": "
                              (entity-from-header (car x))
                              "\n    " owl-subclause ": "
                              (entity-from-header (car l))))
                    (cdr l) "")
          ;one-of pattern
          (if (member "oneof" (org-tags-in-string (car l))) (class-oneof-from-header l))
          ;disjoint pattern
          (if (member "disjoint" (org-tags-in-string (car l))) (class-disjoint-from-header l))
          (resource-taxonomy-from-l (cdr l) owl-type owl-subclause)))))

(defun resource-taxonomy-from-header (header-id owl-type owl-relation)
  "HEADER-ID is an org location id, OWL-TYPE is Class, etc., OWL-RELATION is SubClassOf, etc."
  (save-excursion
    (org-id-goto header-id)
    (if (org-goto-first-child)
        (let ((hierarchy-l (org-list-siblings)))
          (resource-taxonomy-from-l hierarchy-l owl-type owl-relation))
      (concat "## no " owl-type "taxonomy"))))
;; defun-resource-taxonomy ends here

;; [[file:../elot-defs.org::defun-latex-export][defun-latex-export]]
(defun ontology-resource-section (level numbered-p)
  (if numbered-p
    (cond 
      ((= 1 level) "\\chapter{%s}")
      ((= 2 level) "\\section{%s}")
      ((= 3 level) "\\subsection{%s}")
      ((= 4 level) "\\subsubsection{%s}")
      ((= 5 level) "\\subsubsubsection{%s}")
      ((= 6 level) "\\paragraph{%s}")
      (t "\\subparagraph{%s}"))
    (cond ;; Koma-script commands, see https://tex.stackexchange.com/questions/193767/how-to-use-unnumbered-chapters-with-koma-script/193799#193799
     ((= 1 level) "\\addchap{%s}")
     ((= 2 level) "\\addsec{%s}")
     ((= 3 level) "\\subsection*{%s}")
     (t "\\subsubsection*{%s}"))
    ))
;; defun-latex-export ends here

;; [[file:../elot-defs.org::defun-get-heading-nocookie][defun-get-heading-nocookie]]
(defun org-get-heading-nocookie (&optional no-tags no-todo no-priority no-comment)
  (replace-regexp-in-string " \\[[[:digit:]/%]+\\]$" ""
                            (org-get-heading no-tags no-todo no-priority no-comment)))
;; defun-get-heading-nocookie ends here

;; [[file:../elot-defs.org::defun-get-description-entry][defun-get-description-entry]]
(defun org-get-description-entry (tag)
  (save-excursion
    (if (search-forward-regexp tag nil t)
        (let* ((element (org-element-at-point))
               (beg (org-element-property :contents-begin element))
               (end (org-element-property :contents-end element))
               (entry-text (buffer-substring-no-properties beg end)))
           (replace-regexp-in-string "\n\s*" " " entry-text)))))
;; defun-get-description-entry ends here

;; [[file:../elot-defs.org::defun-ELOT-latex-derived-backend][defun-ELOT-latex-derived-backend]]
;; see https://emacs.stackexchange.com/questions/55231/org-mode-export-html-add-name-attirbute-to-checkbox-input
  (org-export-define-derived-backend 'ELOT-latex 'latex
    :translate-alist '((item . my-item-translator)))
  (defvar item-process nil)

  (defun my-item-translator (item c info)
    (let* ((item-tag-maybe (car (org-element-property :tag item)))
           (item-tag-stringp (stringp item-tag-maybe))
           (item-tag (if item-tag-stringp (substring-no-properties item-tag-maybe) item-tag-maybe)))
      (if (and item-tag-stringp (string= item-tag "item-translate-start")) (setq item-process t))
      (if (and item-tag-stringp (string= item-tag "item-translate-stop")) (setq item-process nil))
    (when (and item-process item-tag-stringp)
      (progn
        ;(message (substring-no-properties item-tag))
        (setf (plist-get (cadr item) :checkbox) nil)  ; set checkbox here
        (let ((tag-mapped (assoc item-tag (quote
(("iof-av:isPrimitive" . "primitive?")
 ("iof-av:naturalLanguageDefinition" . "definition")
 ("iof-av:primitiveRationale" . "why primitive")
 ("iof-av:usageNote" . "usage note")
 ("owl:deprecated" . "deprecated?")
 ("rdfs:seeAlso" . "see also")
 ("skos:example" . "example")
 ("skos:scopeNote" . "scope note")
 ("skos:altLabel" . "alternative label")
 ("iof-av:explanatoryNote" . "explanatory note")
 ("rdfs:comment" . "comment")
 ("rdfs:isDefinedBy" . "defined by")
 ("iof-av:firstOrderLogicDefinition" . "first-order logic definition")
 ("iof‑av:semiFormalNaturalLanguageDefinition" . "semi-formal definition")
 ("iof-av:semiFormalNaturalLanguageAxiom" . "semi-formal axiom")
 ("iof-av:adaptedFrom" . "adapted from")
 ("iof-av:synonym" . "synonym"))
                                         ))))
            (if tag-mapped
                (setf (plist-get (cadr item) :tag) (cdr tag-mapped)))
            )))
    (unless (and item-tag-stringp
                 (or (string= item-tag "item-translate-start") (string= item-tag "item-translate-stop")))
      (org-latex-item item c info))))
;; defun-ELOT-latex-derived-backend ends here
