elot-defs.org
*** Passthrough execute for ttl blocks
To get the ttl block to process correctly, for rdfpuml use.
#+begin_src emacs-lisp
(defun org-babel-execute:passthrough (body params) body)
(unless (fboundp 'org-babel-execute:ttl)                
  (defalias 'org-babel-execute:ttl 'org-babel-execute:passthrough))
#+end_src

*** Tempo templates
**** ELOT document header
Insert a document header with =<oh=.
#+begin_src emacs-lisp :results none
	(tempo-define-template "elot-doc-header"
	 '("# -*- eval: (load-library \"elot-defaults\") -*-" > n
		"#+title: " (p "Document title: " doctitle) > n
		"#+subtitle: An OWL ontology" > n
		"#+author: " (p "Author name: " authname) > n
		"#+date: WIP (version of " (format-time-string "%Y-%m-%d %H:%M") ")" > n
		(progn (load-library "elot-defaults") "")
		)
	 "<oh"
	 "ELOT document header"
	 'org-tempo-tags)
#+end_src
