elot-package/elot.el

;; [[file:../elot-defs.org::*Passthrough execute for ttl blocks][Passthrough execute for ttl blocks:1]]
(defun org-babel-execute:passthrough (body params) body)
(unless (fboundp 'org-babel-execute:ttl)                
  (defalias 'org-babel-execute:ttl 'org-babel-execute:passthrough))
;; Passthrough execute for ttl blocks:1 ends here

;; [[file:../elot-defs.org::*ELOT document header][ELOT document header:1]]
(tempo-define-template "elot-doc-header"
 '("# -*- eval: (load-library \"elot-defaults\") -*-" > n
  "#+title: " (p "Document title: " doctitle) > n
  "#+subtitle: An OWL ontology" > n
  "#+author: " (p "Author name: " authname) > n
  "#+date: WIP (version of " (format-time-string "%Y-%m-%d %H:%M") ")" > n
  )
 "<oh"
 "ELOT document header"
 'org-tempo-tags)
;; ELOT document header:1 ends here

;; [[file:../elot-defs.org::*ELOT ontology skeleton][ELOT ontology skeleton:1]]
(tempo-define-template
