elot-defs.org
*** End with "provides"
#+begin_src emacs-lisp
(provide 'elot)
#+end_src
